import sqlite3

rows = [
    (1, 'а', 'a', '(спол.) але | (спол.) і'),
    (2, 'бабка', 'babka', 'хижа комаха з довгим тонким тілом і двома парами великих прозорих крил | (зневажливо) жінка'),
    (3, 'виходити боком', 'wychodzić bokiem', 'призводити до поганих наслідків | набридати'),
    (4, 'гадати', 'gadać', 'думати, вважати | балакати'),
    (5, 'грубий', 'gruby', 'невихований, різкий | товстий, гладкий'),
    (6, 'живіт', 'żywot', 'частина тіла людини і тварини, в якій містяться шлунок, кишечник, печінка і т. ін. | життя; спосіб життя'),
    (7, 'заховати', 'zachować', 'класти що-небудь у невідоме для інших місце | зберегти щось у минулому стані попри обставини'),
    (8, 'зачати', 'zacząć', 'зробити дитину | розпочати щось'),
    (9, '(з)догадатися', 'dogadać się', 'зрозуміти, збагнути щось | порозумітися з кимось якоюсь мовою'),
    (10, 'Інна', 'inna', '''жіноче ім'я | інша'''),
    (11, 'кінцівка', 'końcówka', 'завершальна частина чогось; у людей і тварин: частина тіла | закінчення чогось; у граматиці: закінчення частин мови'),
    (12, 'коняки', 'koniaki', '(розм.) коні, кобили | коньяк (у мн.)'),
    (13, 'люстра', 'lustra', 'підвісний освітлювальний прилад, що має кілька джерел світла (свічок, електроламп) та оздоблену арматуру | дзеркала'),
    (14, 'майки', 'majtki', 'трикотажні сорочки без рукавів і коміра | труси'),
    (15, 'марення', 'marzenie', 'безладне, безтямне говоріння в гарячці або уві сні | мрія'),
    (16, 'матка', 'matka', 'внутрішній статевий орган жінки та самиці тварини, у якому розвивається зародок | мати'),
    (17, 'милість', 'miłość', 'доброзичливе, привітне ставлення до кого-небудь | любов, кохання'),
    (18, 'мова', 'mowa', 'сукупність загальноприйнятих у межах суспільства усних та письмових знаків для комунікації | мовлення'),
    (19, 'напевно', 'na pewno', 'мабуть | точно'),
    (20, 'подорожник', 'podróżnik', '''придорожній бур'ян, що використовується в народній медицині | мандрівник'''),
    (21, 'розбиратися', 'rozbierać się', '''з'ясовувати істину, вникати в деталі | роздягатися'''),
    (22, 'ринок', 'rynek', 'базар | у старовинних містах головна площа'),
    (23, 'рухатися', 'ruchać się', 'перебувати в русі, переміщатися | (грубо) займатися сексом'),
    (24, 'склеп', 'sklep', 'закрите підземне приміщення, в якому зберігаються труни з померлими | крамниця, магазин'),
    (25, 'та', 'ta', 'не ця, віддалена від мовця | ця, наближена до мовця'),
    (26, 'Таня', 'tania', '''жіноче ім'я | дешева'''),
    (27, 'хохол', 'chochoł', '''образлива назва українця | солом'яне накриття для дерев і кущів у саду на зиму'''),
    (28, 'чашка', 'czaszka', '''посудина, з якої п'ють чай, каву та інші напої | череп'''),
    (29, 'чоловік', 'człowiek', 'особа чоловічої статі, протилежна до жінки | людина'),
    (30, 'чути', 'czuć', 'сприймати звуки за допомогою органів слуху | відчувати'),
    (31, 'штука', 'sztuka', 'предмет, річ, ситуація | мистецтво'),
    (32, 'язик', 'język', '''м'язовий орган у ротовій порожнині, що допомагає захоплювати та ковтати їжу | мова''')
    ]

connection = sqlite3.connect('ukr_pl homonyms.db')
cursor = connection.cursor()

cursor.execute('''
            CREATE TABLE IF NOT EXISTS ukr_pl_homonyms
            (word_id INTEGER PRIMARY KEY, ukr_word TEXT, pl_word TEXT, definition TEXT)
            ''')

inserting_rows = """INSERT OR IGNORE INTO ukr_pl_homonyms VALUES (?, ?, ?, ?)"""

cursor.executemany(inserting_rows, rows)

cursor.execute("""
            UPDATE ukr_pl_homonyms SET definition = 'класти що-небудь у невідоме для інших місце | зберегти щось у минулому стані попри обставини' WHERE word_id = 7
            """)

for row in cursor.execute("""SELECT * FROM ukr_pl_homonyms"""):
    print(row)

connection.commit()
connection.close()
